#### 1. 
Задано натуральное число n. Делится ли оно одновременно на a и на b ?
Входные данные -
Три натуральных числа n, a, b, не больше 10 в 9 степени.

Выходные данные:
Выведите YES ессли n делится одновременно на a и на b.
Выведите NO иначе.

```
n = int(input('n= ' ))
a = int(input('a= ' ))
b = int(input('b= ' ))

if n % a == 0 and n % b == 0:
    print('YES')
else:
    print('NO')
```

#### 2. 
Вам предлагается рассудить спор Сарумана и Саурона о том, чья армия силнеее. Считайте, что один орк Сарумана по силе равен 1.5 орку Саурона.
Вводные данные:
В первой строке число Х - количество орков вармии Сарумана, во второй строчке Y - количество орков в армии Саурона (0 ≤ X, Y ≤ 10100).

Выходные данные:
Выведите "Sauron", если армия Саурона сильнее. Если если же сильнее армия Сарумана, выведите "Saruman". В случае ничьей выведите "Tie".
```
y_sau = int(input('Sau:'))
x_sar = int(input('Sar:'))*1.5

if y_sau > x_sar:
    print('Sauron')
elif x_sar > y_sau:
    print('Saruman')
else:
    print('Tie')
```
#### 3. 

По данному натуральному числу N найти наибольшую целую степень двойки, которая не превышает N. Выведите показатель степени и саму степень.
Операцией сведения в степень воспользоваться нельзя.
Вводится такая же последовательность. Нужно вывести среднее арифметическое этой последовательности, ее максимальное и минимальное значения

counter = 0
s = 0
while True:
    n = int(input())
    if n == 0:
        break
    s += n
    counter += 1

print(s)
print(counter)
print("The end")

