Определить количество парных элементов в завершающей последовательности числом 0
```
counter = 0

while True:
    n = int(input())
    if n == 0:
        break
    if n % 2 == 0:
        counter += 1

print(counter)
```

По заданому цілому числу N роздрукувати усі квадрати натуральних чисел, що не перевершують N, в порядку спадання.

```

```
В первый день спортсмен пробежал x километров, а затем он каждый день увеличивал пробег на 10% от предыдущего значения. По данному числу y определите номер дня, на который пробег спортсмена составит не менее y километров.
Программа получает на вход действительные числа x и y и должна вывести одно натуральное число.
```

```
